In [1]:
import pandas as pd
import numpy as np
df=pd.DataFrame({'key':['A','B','C','A','B','C','A','B','C'],'data':[0,5,10,5,10,15,10,15,20]})
df

  key  data
0   A     0
1   B     5
2   C    10
3   A     5
4   B    10
5   C    15
6   A    10
7   B    15
8   C    20

In [7]:
grouped=df.groupby(['key']) #通过key分组

In [22]:
#查看分组情况
for name,group in grouped:
    print(name)
    print(group)

A
  key  data
0   A     0
3   A     5
6   A    10
B
  key  data
1   B     5
4   B    10
7   B    15
C
  key  data
2   C    10
5   C    15
8   C    20

In [9]:
grouped.sum() #对每个分组应用sum函数，并最后组合成结果

     data
key
A      15
B      30
C      45

In [11]:
df.groupby(['key']).sum() #链式调用先分组再用聚合函数聚合

     data
key
A      15
B      30
C      45

In [21]:
df.groupby()

TypeError: You have to supply one of 'by' and 'level'

In [19]:
#查看分组情况
for dtype,group in grouped:
    print(dtype)
    print(group)

A
  key  data
0   A     0
3   A     5
6   A    10
B
  key  data
1   B     5
4   B    10
7   B    15
C
  key  data
2   C    10
5   C    15
8   C    20

In [42]:
df=pd.DataFrame({'key1':['A','B','C','A','B','C','A','B','C'],
                 'key2':['2','1','1','2','2','2','2','1','1'],
                 'data':[0,5,10,5,10,15,10,15,20]})
df

  key1 key2  data
0    A    2     0
1    B    1     5
2    C    1    10
3    A    2     5
4    B    2    10
5    C    2    15
6    A    2    10
7    B    1    15
8    C    1    20

In [43]:
grouped=df.groupby(['key1','key2'])
#查看分组情况
for group_name,group_data in grouped:
    print(group_name)
    print(group_data)

('A', '2')
  key1 key2  data
0    A    2     0
3    A    2     5
6    A    2    10
('B', '1')
  key1 key2  data
1    B    1     5
7    B    1    15
('B', '2')
  key1 key2  data
4    B    2    10
('C', '1')
  key1 key2  data
2    C    1    10
8    C    1    20
('C', '2')
  key1 key2  data
5    C    2    15

In [41]:
grouped.sum()

           data
key2 key1
1    B       20
     C       30
2    A       15
     B       10
     C       15

In [36]:
grouped.sum()

           data
key1 key2
A    2       15
B    1       20
     2       10
C    1       30
     2       15

In [61]:
people=pd.DataFrame(np.random.randn(5,5),
                   columns=['a','b','c','d','e'],
                   index=['Joe','Steve','Wes','Jim','Bob'])
people

              a         b         c         d         e
Joe   -0.951618  0.993832  0.086304  0.406243 -1.424349
Steve  0.295523  0.401477  1.688411 -0.481711 -2.049244
Wes   -0.220601  0.885299 -0.607416 -0.125493 -0.063660
Jim   -0.442228  1.362309 -0.439804 -0.733994  0.329534
Bob   -0.861706 -1.769616  0.303790 -1.624855  0.438009

In [62]:
mapping={'a':'red','b':'red','c':'blue','d':'blue','e':'red'}#定义分组字典

In [63]:
by_column=people.groupby(mapping,axis=1)

In [64]:
#查看分组情况
for group_name,group_data in by_column:
    print(group_name)
    print(group_data)

blue
              c         d
Joe    0.086304  0.406243
Steve  1.688411 -0.481711
Wes   -0.607416 -0.125493
Jim   -0.439804 -0.733994
Bob    0.303790 -1.624855
red
              a         b         e
Joe   -0.951618  0.993832 -1.424349
Steve  0.295523  0.401477 -2.049244
Wes   -0.220601  0.885299 -0.063660
Jim   -0.442228  1.362309  0.329534
Bob   -0.861706 -1.769616  0.438009

In [65]:
by_column.sum()

           blue       red
Joe    0.492547 -1.382136
Steve  1.206700 -1.352244
Wes   -0.732909  0.601038
Jim   -1.173798  1.249616
Bob   -1.321065 -2.193312

In [67]:
map_series=pd.Series(mapping)
map_series

a     red
b     red
c    blue
d    blue
e     red
dtype: object

In [68]:
by_series=people.groupby(map_series,axis=1)
#查看分组情况
for group_name,group_data in by_series:
    print(group_name)
    print(group_data)

blue
              c         d
Joe    0.086304  0.406243
Steve  1.688411 -0.481711
Wes   -0.607416 -0.125493
Jim   -0.439804 -0.733994
Bob    0.303790 -1.624855
red
              a         b         e
Joe   -0.951618  0.993832 -1.424349
Steve  0.295523  0.401477 -2.049244
Wes   -0.220601  0.885299 -0.063660
Jim   -0.442228  1.362309  0.329534
Bob   -0.861706 -1.769616  0.438009

In [69]:
by_len=people.groupby(len)
#查看分组情况
for group_name,group_data in by_len:
    print(group_name)
    print(group_data)

3
            a         b         c         d         e
Joe -0.951618  0.993832  0.086304  0.406243 -1.424349
Wes -0.220601  0.885299 -0.607416 -0.125493 -0.063660
Jim -0.442228  1.362309 -0.439804 -0.733994  0.329534
Bob -0.861706 -1.769616  0.303790 -1.624855  0.438009
5
              a         b         c         d         e
Steve  0.295523  0.401477  1.688411 -0.481711 -2.049244

In [112]:
df=pd.DataFrame({'key':['A','B','C','A','B','C','A','B','C'],
                 'data':[0,5,10,5,10,15,10,15,20]},
                index=[1,2,3,4,5,6,7,8,9])
df

  key  data
1   A     0
2   B     5
3   C    10
4   A     5
5   B    10
6   C    15
7   A    10
8   B    15
9   C    20

In [113]:
#自定义函数区分大于5和小于5的数据
def big5(x):  
    result=0
    if x>5:
        result=1
    return result

by_big5=df.groupby(big5)  #根据索引是否大于5进行分组
#查看分组情况
for group_name,group_data in by_big5:
    print(group_name)
    print(group_data)

0
  key  data
1   A     0
2   B     5
3   C    10
4   A     5
5   B    10
1
  key  data
6   C    15
7   A    10
8   B    15
9   C    20

In [114]:
by_big5.mean() #分组平均值聚合

   data
0     6
1    15

In [119]:
by_big5[['data']].count() #分组数量

   data
0     5
1     4

In [120]:
by_big5[['data']].median() #分组计算中位数聚合

   data
0     5
1    15

In [115]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

In [99]:
df

     A      B         C         D
0  foo    one -0.236300  0.176738
1  bar    one  0.477154 -0.147403
2  foo    two  1.891947  0.539716
3  bar  three  0.477423 -1.414859
4  foo    two -0.206574 -0.760666
5  bar    two -0.909250 -0.507470
6  foo    one  0.513834  1.621380
7  foo  three -0.678936 -2.333565

In [104]:
def get_letter_type(letter):
    if letter.lower() in 'aeiou':
        return 'vowel'
    else:
        return 'consonant'
    
grouped = df.groupby(get_letter_type, axis=1)

In [105]:
#查看分组情况
for group_name,group_data in grouped:
    print(group_name)
    print(group_data)

consonant
       B         C         D
0    one -0.236300  0.176738
1    one  0.477154 -0.147403
2    two  1.891947  0.539716
3  three  0.477423 -1.414859
4    two -0.206574 -0.760666
5    two -0.909250 -0.507470
6    one  0.513834  1.621380
7  three -0.678936 -2.333565
vowel
     A
0  foo
1  bar
2  foo
3  bar
4  foo
5  bar
6  foo
7  foo

In [121]:
df=pd.DataFrame({'key':['A','B','C','A','B','C','A','B','C'],
                 'data':[0,5,10,5,10,15,10,15,20]})
df

  key  data
0   A     0
1   B     5
2   C    10
3   A     5
4   B    10
5   C    15
6   A    10
7   B    15
8   C    20

In [127]:
grouped=df.groupby(['key'])
#查看分组情况
for group_name,group_data in grouped:
    print(group_name)
    print(group_data)

A
  key  data
0   A     0
3   A     5
6   A    10
B
  key  data
1   B     5
4   B    10
7   B    15
C
  key  data
2   C    10
5   C    15
8   C    20

In [128]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

grouped.agg(peak_to_peak)

     data
key
A      10
B      10
C      10

In [134]:
grouped.filter(lambda x: len(x) >= 4)

Empty DataFrame
Columns: [key, data]
Index: []

In [180]:
df=pd.DataFrame({'key':['A','B','C','A','B','C','A','B','C'],
                 'data':[0,5,10,5,10,15,10,15,20]})
df

  key  data
0   A     0
1   B     5
2   C    10
3   A     5
4   B    10
5   C    15
6   A    10
7   B    15
8   C    20

In [183]:
grouped=df.groupby(['key'])
#查看分组情况
for group_name,group_data in grouped:
    print(group_name)
    print(group_data)

A
  key  data
0   A     0
3   A     5
6   A    10
B
  key  data
1   B     5
4   B    10
7   B    15
C
  key  data
2   C    10
5   C    15
8   C    20

In [204]:
def add1(df):
    if df[:]['data'].sum()<25:
        return df[:][['data']]+1
    else:
        return df[:][['data']]

In [205]:
grouped.apply(add1)

       data
key
A   0     1
    3     6
    6    11
B   1     5
    4    10
    7    15
C   2    10
    5    15
    8    20

In [229]:
def filtersum25(x):
    if x['data'].sum()>25:
        return True
    else:
        return False

In [231]:
grouped.filter(filtersum25)

  key  data
1   B     5
2   C    10
4   B    10
5   C    15
7   B    15
8   C    20